#+title: Res

#+begin_src python
import itertools

return list(itertools.pairwise(range(1, 100)))
#+end_src

#+RESULTS:
|  1 |  2 |
|  2 |  3 |
|  3 |  4 |
|  4 |  5 |
|  5 |  6 |
|  6 |  7 |
|  7 |  8 |
|  8 |  9 |
|  9 | 10 |
| 10 | 11 |
| 11 | 12 |
| 12 | 13 |
| 13 | 14 |
| 14 | 15 |
| 15 | 16 |
| 16 | 17 |
| 17 | 18 |
| 18 | 19 |
| 19 | 20 |
| 20 | 21 |
| 21 | 22 |
| 22 | 23 |
| 23 | 24 |
| 24 | 25 |
| 25 | 26 |
| 26 | 27 |
| 27 | 28 |
| 28 | 29 |
| 29 | 30 |
| 30 | 31 |
| 31 | 32 |
| 32 | 33 |
| 33 | 34 |
| 34 | 35 |
| 35 | 36 |
| 36 | 37 |
| 37 | 38 |
| 38 | 39 |
| 39 | 40 |
| 40 | 41 |
| 41 | 42 |
| 42 | 43 |
| 43 | 44 |
| 44 | 45 |
| 45 | 46 |
| 46 | 47 |
| 47 | 48 |
| 48 | 49 |
| 49 | 50 |
| 50 | 51 |
| 51 | 52 |
| 52 | 53 |
| 53 | 54 |
| 54 | 55 |
| 55 | 56 |
| 56 | 57 |
| 57 | 58 |
| 58 | 59 |
| 59 | 60 |
| 60 | 61 |
| 61 | 62 |
| 62 | 63 |
| 63 | 64 |
| 64 | 65 |
| 65 | 66 |
| 66 | 67 |
| 67 | 68 |
| 68 | 69 |
| 69 | 70 |
| 70 | 71 |
| 71 | 72 |
| 72 | 73 |
| 73 | 74 |
| 74 | 75 |
| 75 | 76 |
| 76 | 77 |
| 77 | 78 |
| 78 | 79 |
| 79 | 80 |
| 80 | 81 |
| 81 | 82 |
| 82 | 83 |
| 83 | 84 |
| 84 | 85 |
| 85 | 86 |
| 86 | 87 |
| 87 | 88 |
| 88 | 89 |
| 89 | 90 |
| 90 | 91 |
| 91 | 92 |
| 92 | 93 |
| 93 | 94 |
| 94 | 95 |
| 95 | 96 |
| 96 | 97 |
| 97 | 98 |
| 98 | 99 |


#+begin_src python
import time_estimate

return list(enumerate(time_estimate.probability_of_winning(1, 9, 80), 1))
#+end_src

#+RESULTS:
|  1 |                    0.0 |
|  2 |                    0.0 |
|  3 |                    0.0 |
|  4 |                    0.0 |
|  5 |                    0.0 |
|  6 |                    0.0 |
|  7 |                    0.0 |
|  8 | 4.3122172499465705e-12 |
|  9 |  3.449751595496764e-11 |
| 10 | 1.5523915486426176e-10 |
| 11 |  5.174638495475392e-10 |
| 12 | 1.4230252531888254e-09 |
| 13 | 3.4152608519022465e-09 |
| 14 |  7.399731827284484e-09 |
| 15 | 1.4799463432524362e-08 |
| 16 | 2.7748994324561238e-08 |
| 17 | 4.9331545182162984e-08 |
| 18 |   8.38636269318016e-08 |
| 19 | 1.3723138936327928e-07 |
| 20 |  2.172830333435627e-07 |
| 21 | 3.3428158974224687e-07 |
| 22 |   5.01422384502348e-07 |
| 23 |  7.354194974107386e-07 |
| 24 | 1.0571655273405867e-06 |
| 25 | 1.4924689799578061e-06 |
| 26 |  2.072873583114365e-06 |
| 27 | 2.8365638508054403e-06 |
| 28 |  3.829361198359749e-06 |
| 29 |  5.105814931183339e-06 |
| 30 | 6.7303924093931045e-06 |
| 31 |  8.778772707884741e-06 |
| 32 | 1.1339248080832753e-05 |
| 33 | 1.4514237543727937e-05 |
| 34 | 1.8421916882283007e-05 |
| 35 |  2.319796940741803e-05 |
| 36 | 2.8997461759106002e-05 |
| 37 |  3.599684908028866e-05 |
| 38 |  4.439611386597431e-05 |
| 39 |  5.442104280306559e-05 |
| 40 |  6.632564591646517e-05 |
| 41 |  8.039472232290734e-05 |
| 42 |  9.694657691883268e-05 |
| 43 | 0.00011633589230264363 |
| 44 | 0.00013895676025033055 |
| 45 | 0.00016524587705446514 |
| 46 | 0.00019568590703811228 |
| 47 | 0.00023080901855776492 |
| 48 |  0.0002712005968055209 |
| 49 | 0.00031750313772349603 |
| 50 | 0.00037042032734391217 |
| 51 |  0.0004307213108651897 |
| 52 |  0.0004992451557754851 |
| 53 |  0.0005769055133406642 |
| 54 |  0.0006646954827619345 |
| 55 |  0.0007636926823222367 |
| 56 |  0.0008750645318276185 |
| 57 |  0.0010000737506601354 |
| 58 |   0.001140084075752501 |
| 59 |  0.0012965662037970338 |
| 60 |  0.0014711039620003419 |
| 61 |   0.001665400711698739 |
| 62 |  0.0018812859891410572 |
| 63 |  0.0021207223877588444 |
| 64 |  0.0023858126862288387 |
| 65 |   0.002678807226643043 |
| 66 |  0.0030021115470997284 |
| 67 |  0.0033582942730270293 |
| 68 |   0.003750095271546572 |
| 69 |   0.004180434073199679 |
| 70 |   0.004652418565335159 |
| 71 |   0.005169353961483325 |
| 72 |   0.005734752051020697 |
| 73 |   0.006352340733438155 |
| 74 |     0.0070260738415302 |
| 75 |    0.00776014125780955 |
| 76 |   0.008558979328466387 |
| 77 |   0.009427281579180269 |
| 78 |    0.01037000973709834 |
| 79 |     0.0113924050632912 |

#+PLOT: ind:1
|  x |                      y |
|----+------------------------|
| 15 | 3.3306690738754696e-14 |
| 16 |  6.661338147750939e-13 |
| 17 |  4.729550084903167e-12 |
| 18 |  2.531308496145357e-11 |
| 19 | 1.0758061108617767e-10 |
| 20 |  3.873568132917171e-10 |
| 21 |  1.226618806526858e-09 |
| 22 | 3.5045966129132466e-09 |
| 23 |  9.199541017856916e-09 |
| 24 | 2.2487777751045712e-08 |
| 25 |  5.172189021518392e-08 |
| 26 | 1.1284778145270735e-07 |
| 27 | 2.3509946500688272e-07 |
| 28 |  4.701987982302924e-07 |
| 29 |  9.068112957200114e-07 |
| 30 |  1.692712279122155e-06 |
| 31 | 3.0680336690069865e-06 |
| 32 |  5.414154267358029e-06 |
| 33 |  9.324308227198763e-06 |
| 34 |  1.570390222560558e-05 |
| 35 | 2.5910901318093593e-05 |
| 36 | 4.1949564345000745e-05 |
| 37 |  6.673432835402338e-05 |
| 38 | 0.00010444481971361164 |
| 39 | 0.00016099779263722969 |
| 40 | 0.00024466715543325357 |
| 41 | 0.00036688882155300195 |
| 42 |  0.0005432922390277151 |
| 43 |  0.0007950037837428647 |
| 44 |  0.0011502663528396573 |
| 45 |  0.0016464103056723634 |
| 46 |   0.002332186413827486 |
| 47 |  0.0032704204927666014 |
| 48 |   0.004540854539039962 |
| 49 |   0.006242874816981492 |
| 50 |   0.008497558004230021 |
| 51 |   0.011448048014594092 |
| 52 |   0.015256663808817406 |
| 53 |    0.02009631068826645 |
| 54 |     0.0261327787139638 |
| 55 |    0.03349359441458666 |
| 56 |    0.04221882398934573 |
| 57 |    0.05219075274234575 |
| 58 |    0.06304456631130506 |
| 59 |    0.07407344562379303 |
| 60 |    0.08416056822079909 |
| 61 |    0.09179519840650363 |
| 62 |    0.09524876162648321 |
| 63 |    0.09297334708782556 |
| 64 |    0.08420309462069309 |
| 65 |    0.06957182300611209 |
| 66 |   0.051372349495087954 |
| 67 |    0.03306346883489131 |
| 68 |    0.01799413067147615 |
| 69 |   0.007983400076695624 |
| 70 |   0.002762972775916417 |
| 71 |  0.0007073916847538664 |
| 72 | 0.00012569061429834605 |
| 73 | 1.4349097741450656e-05 |
| 74 |  9.584745079838086e-07 |
| 75 |  3.340346532709759e-08 |
| 76 |  5.269805702923236e-10 |
| 77 |  3.149702720861569e-12 |
| 78 |  5.662137425588298e-15 |
| 79 |                    0.0 |
| 80 |                    0.0 |
